SummerApp/app/controllers/api/users_api_controller.rb

    def create
      @user = User.new(user_params)
      @user.save
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Lautaro"], ["age", 26], ["created_at", "2023-01-26 22:40:17.140694"], ["updated_at", "2023-01-26 22:40:17.140694"]]

    def update
      @user = User.find(params[:id])
      @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "age" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Lautaro"], ["age", 26], ["updated_at", "2023-01-27 14:15:21.517577"], ["id", 21]]