SummerApp/app/views/users/show.html.erb

SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1 AND "follows"."follower_id" = $2  [["follower_id", 20], ["follower_id", 20]]
---
      <h2><%= @user.name %></h2>
      <h3> Followers: <%= @user.followers.count %></h3>
      <% @user.followers.each do |f| %>