SummerApp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("name", "age", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ale"], ["age", 23], ["created_at", "2023-01-22 17:31:40.993273"], ["updated_at", "2023-01-22 17:31:40.993273"]]

  def toggle_follow
    @user = User.find(params[:user_id])
    @follow = @user.received_follows.where(follower_id: current_user.id)
    if @follow.blank?
      @user.received_follows.create(follower_id: current_user.id)
    else
      @follow.first.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
INSERT INTO "follows" ("follower_id", "followed_user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["follower_id", 20], ["followed_user_id", 38], ["created_at", "2023-01-24 23:07:22.670168"], ["updated_at", "2023-01-24 23:07:22.670168"]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 24]]
DELETE FROM "follows" WHERE "follows"."id" = $1  [["id", 52]]

  def update
    @user = User.find(params[:id])
    @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 33], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Usuario admin"], ["updated_at", "2023-01-23 01:45:05.163827"], ["id", 20]]

  def destroy
    @user = User.find(params[:id])
    @user.destroy!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 22]]

  def show
    @user = User.find(params[:id])
    @following = nil
    @followers = nil
    @following = @user.received_follows.where(follower_id: current_user.id).present?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 38], ["LIMIT", 1]]
SELECT "follows".* FROM "follows" WHERE "follows"."follower_id" = $1  [["follower_id", 22]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 20], ["LIMIT", 1]]