SummerApp/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 21], ["id", 22], ["id", 23], ["id", 20]]
---
  def set_user
    @user = User.find(params[:id])